"""
Университет GeekBrains
Курс: Основы языка Python.
Урок 4.
Задание 1.
Автор: Михаил Духонин
Создан: 20 Май 2020.
Задание:
Реализовать скрипт, в котором должна быть предусмотрена функция расчета заработной платы сотрудника. В расчете необходимо использовать формулу: (выработка в часах*ставка в час) + премия. Для выполнения расчета для конкретных значений необходимо запускать скрипт с параметрами.

"""

# Импорт

# Функции.

def ():

def main():
    """Логика программы."""


if __name__ == '__main__':
    main()
