"""
Университет GeekBrains
Курс: Основы языка Python.
Урок 4.
Задание 2.
Автор: Михаил Духонин
Создан: 20 Май 2020.
Задание:
Представлен список чисел. Необходимо вывести элементы исходного списка, значения которых больше предыдущего элемента.
Подсказка: элементы, удовлетворяющие условию, оформить в виде списка. Для формирования списка использовать генератор.
Пример исходного списка: [300, 2, 12, 44, 1, 1, 4, 10, 7, 1, 78, 123, 55].
Результат: [12, 44, 4, 10, 78, 123].

"""

# Импорт

# Функции.

def ():

def main():
    """Логика программы."""


if __name__ == '__main__':
    main()
