"""
Университет GeekBrains
Курс: Основы языка Python.
Урок 4.
Задание 4.
Автор: Михаил Духонин
Создан: 20 Май 2020.
Задание:
Представлен список чисел. Определить элементы списка, не имеющие повторений. Сформировать итоговый массив чисел, соответствующих требованию. Элементы вывести в порядке их следования в исходном списке. Для выполнения задания обязательно использовать генератор.
Пример исходного списка: [2, 2, 2, 7, 23, 1, 44, 44, 3, 2, 10, 7, 4, 11].
Результат: [23, 1, 3, 10, 4, 11]

"""

# Импорт

# Функции.

def ():

def main():
    """Логика программы."""


if __name__ == '__main__':
    main()
