"""
Университет GeekBrains
Курс: Основы языка Python.
Урок 4.
Задание 5.
Автор: Михаил Духонин
Создан: 20 Май 2020.
Задание:
Реализовать формирование списка, используя функцию range() и возможности генератора. В список должны войти четные числа от 100 до 1000 (включая границы). Необходимо получить результат вычисления произведения всех элементов списка.
Подсказка: использовать функцию reduce().

"""

# Импорт

# Функции.

def ():

def main():
    """Логика программы."""


if __name__ == '__main__':
    main()
