"""
Университет GeekBrains
Курс: Основы языка Python.
Урок 4.
Задание 7.
Автор: Михаил Духонин
Создан: 20 Май 2020.
Задание:
Реализовать генератор с помощью функции с ключевым словом yield, создающим очередное значение. При вызове функции должен создаваться объект-генератор. Функция должна вызываться следующим образом: for el in fact(n). Функция отвечает за получение факториала числа, а в цикле необходимо выводить только первые n чисел, начиная с 1! и до n!.
Подсказка: факториал числа n — произведение чисел от 1 до n. Например, факториал четырёх 4! = 1 * 2 * 3 * 4 = 24.

"""

# Импорт

# Функции.

def ():

def main():
    """Логика программы."""


if __name__ == '__main__':
    main()
